In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create Data
stuff = {'Corporations':['Apple','Google','Meta','Apple','Google','Meta']
         ,'Employees':['Marie','Zagreus','Melissa','Fedosev','Saun','Jokeph']
         ,'Salary':[200,220,190,130,120,150]}
# Create Dataframe
my_df = pd.DataFrame(stuff)
my_df

  Corporations Employees  Salary
0        Apple     Marie     200
1       Google   Zagreus     220
2         Meta   Melissa     190
3        Apple   Fedosev     130
4       Google      Saun     120
5         Meta    Jokeph     150

In [3]:
# Create a funtion
def times1000(x):
    return x*1000

In [4]:
# Use Apply Function
my_df['Salary'].apply(times1000)

0    200000
1    220000
2    190000
3    130000
4    120000
5    150000
Name: Salary, dtype: int64

In [5]:
# Make it into a Dataframe
pd.DataFrame(my_df['Salary'].apply(times1000))

   Salary
0  200000
1  220000
2  190000
3  130000
4  120000
5  150000

In [13]:
# Add Elder last name
def namer(x):
    if x == 'Fedosev':
        return 'Fedosev Mikhael'
    else:
        return x

In [14]:
# Apply
pd.DataFrame(my_df['Employees'].apply(namer))

         Employees
0            Marie
1          Zagreus
2          Melissa
3  Fedosev Mikhael
4             Saun
5           Jokeph

In [15]:
# Use Lambda
pd.DataFrame(my_df['Salary'].apply(lambda x: format(x*1000, ',d')))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000